# 1. Допустим у нас есть список языков программирования. lang1 = 'Rust'
#  languages = ['go', 'java', 'php', 'python', 'javascript', 'ruby'
#  Обязательное условие: если переменная в списке, то нужно вывести на экран 'this languages is in list'.
#  Если этого языка нет в списке, ничего не нужно выводить.

# lang1 = 'Rust'
# languages = ['go', 'java', 'php', 'python', 'javascript', 'ruby']
# for i in languages:
#     print(i)
#     if i==lang1:
#         print ('this languages is in list')
#         break

# 2. Будем работать с тем же списком: languages = ['go', 'java', 'php', 'python', 'javascript', 'ruby']
# С помощью цикла нужно “перебрать” все языки в списке, и когда код доходит до “php”, цикл должен быть прерван.

# lang1 = 'Rust'
# languages = ['go', 'java', 'php', 'python', 'javascript', 'ruby']
# for i in languages:
#     print(i)
#     if i == 'php':
#         break

#3. Напишите код, который берёт цифру 7, умножает саму на себя же 5 раз.
# a = 7
# for i in range (5):
#     print(a)
#     a *= a

#44. Напишите код, который выведет на экран список языков с нумерацией.

# languages = ['go', 'java', 'php', 'python', 'javascript', 'ruby']
# for i in range (len(languages)):
#     print (i, languages[i])

#5. Напишите цикл который выведет на экран:     1,2,3,4,5,6,7,8,9,10,9,8,7,6,5,4,3,2,1
for i


    





