# Создайте класс Student. Создайте внутри класса
# конструктор, который принимает несколько
# аргументов (Имя, группу). Создайте метод show(),
# который будет возвращать нам информацию про
# студента. Напишите рабочий деструктор. Примените
# его и удалите  экземпляр класса.

# class Student:
#     def __init__(self, name, group):
#         self.name = name
#         self.group = group
#
#     def show(self):
#         return (f'Меня зовут {self.name}, я в группе {self.group}')
#
#     def __del__(self):
#         print('Студент выбыл')
#
# student_info = Student('Чолпон', 'NBLC')
# print(student_info.show())




