#Problem_1
#Создайте 4 функции: add(), substract(), multiply(), divide()
# которые будут принимать по 2 аргумента и возвращать результат: сложения, вычитания, умножения и деления.
# def add(slog_1: int, slog_2: int):
#     return  slog_1 + slog_2
#
#
# def substract(v: int, u: int):
#     return v - u
#
#
# def multiply(a: int, b: int):
#     return a*b
#
#
# def devide(x: int, y: int):
#     return x/y


#problem_2
# Написать Функцию которая принимает предложение как аргумент, считает количество букв
# и возвращает сколько символов он ввёл. НЕ ИСПОЛЬЗОВАТЬ функцию len()

# def simbols(word: str):
#     count = 0
#     for i in word:
#         count += 1
#     return count

#problem_3
# def add_two_dict(dict_1, dict_2):
#     dict_1.update(dict_2)
#     return dict_1
#
# b = add_two_dict({'Имя': 'Чолпон'}, {'возраст': 28})
# print(b)

#problem4

# Напишите функцию которая спрашивает у вас чтобы вы хотели заказать покушать и выпить.
# А затем записывает это всё в файл на рабочем столе menu.txt

def kafe():
    menu = input("Что хотите заказать?")
    





