# Создайте функцию которая которая берёт лист делит его пополам и обе стороны разворачивает
# в противоположную сторону. Пример:
# Оригинальный Лист:
# list_1 = ['name', 'age', '1', '19']
# Изменённый Лист:
# list_1 = ['age', 'name', '19', '1']


# list_1 = ['name', 'age', '1', '19']
# def reverse_list():
#     my_list1 = list_1[0:len(list_1)//2]
#     my_list2 = list_1[len(list_1)//2:len(list_1)]
#     total = my_list1[::-1] + my_list2[::-1]
#     print(total)
# reverse_list()


#problem_2
Создайте функцию которая генерирует 10 чисел Фибоначчи:
1,1,2,3,5,8,13,21,34,...
