# Аналог шифра цезаря ". Программа должна запрашивать элементы
# списка через пробел. После чего пользователь должен ввести значение
# для сдвига элементов списка. Значение может быть как положительным,
# так и отрицательным. Если значение положительное, элементы списка
# должны сдвигаться вправо, если отрицательное - влево. Результат
# необходимо вывести на экран:

# Пример:
# [1, 2, 3, 4, 5], сдвиг 2
# [3, 4, 5, 1, 2]

lists = input("ВВедите элементы списка через пробелы ").split( )
steps = int(input('Введите значение для сдвига'))
for i in lists:
    new_list = 







