# #problem_1
# kub = lambda a, b, c: f'Объем бассейна {a*b*c}'
# print(kub(5, 6, 4))

#problem_2

# days_left = lambda last_days: f'До нового года осталось {365-last_days} дней'
# print(days_left(95))

#problem_3/ Напишите программу которая выводит только нечётные числа с помощью рекурсии.

def odd_numbers(number):
    for i